In [61]:
import pandas as pd
import numpy as np
import os

params = {
    "flow":"EXP",
    "year":"1997",
    "db-connector":"clickhouse-local"}

source_url = "http://www.mdic.gov.br/balanca/bd/comexstat-bd/mun/{}_{}_MUN.csv".format(params["flow"], params["year"])

In [62]:
if "{}_{}_MUN.csv".format(params["flow"], params["year"]) not in os.listdir("data_temp/"):
    df = pd.read_csv(source_url)
    df.to_csv("./data_temp/{}_{}_MUN.csv".format(params["flow"], params["year"]))
else:
    df = pd.read_csv("./data_temp/{}_{}_MUN.csv".format(params["flow"], params["year"]))
    
df.head()

,Unnamed: 0,CO_ANO,CO_MES,SH4,CO_PAIS,SG_UF_MUN,CO_MUN,KG_LIQUIDO,VL_FOB
0,0,1997,1,8482,249,SP,3448708,210,8164
1,1,1997,1,8432,249,RS,4302709,261644,256053
2,2,1997,1,9403,275,RS,4314902,83240,263800
3,3,1997,1,9021,756,SP,3450308,27,11104
4,4,1997,1,9403,23,SC,4215802,459073,1099830

In [63]:
df["time_id"] = (df["CO_ANO"].astype("str") + df["CO_MES"].astype("str").str.zfill(2)).astype("int")

df.head()

,Unnamed: 0,CO_ANO,CO_MES,SH4,CO_PAIS,SG_UF_MUN,CO_MUN,KG_LIQUIDO,VL_FOB,time_id
0,0,1997,1,8482,249,SP,3448708,210,8164,199701
1,1,1997,1,8432,249,RS,4302709,261644,256053,199701
2,2,1997,1,9403,275,RS,4314902,83240,263800,199701
3,3,1997,1,9021,756,SP,3450308,27,11104,199701
4,4,1997,1,9403,23,SC,4215802,459073,1099830,199701

In [64]:
p = pd.read_csv("./resources/shared_hs92.csv")
p_dict = {k:v for (k,v) in zip(p["hs4"],p["hs4_id"])}

df["hs4_id"] = df["SH4"].map(p_dict).fillna(33391).astype("int")

df.head()

,Unnamed: 0,CO_ANO,CO_MES,SH4,CO_PAIS,SG_UF_MUN,CO_MUN,KG_LIQUIDO,VL_FOB,time_id,hs4_id
0,0,1997,1,8482,249,SP,3448708,210,8164,199701,37410
1,1,1997,1,8432,249,RS,4302709,261644,256053,199701,37360
2,2,1997,1,9403,275,RS,4314902,83240,263800,199701,12795
3,3,1997,1,9021,756,SP,3450308,27,11104,199701,57949
4,4,1997,1,9403,23,SC,4215802,459073,1099830,199701,12795

In [65]:
g1 = pd.read_csv("./resources/PAIS.csv", sep=";", encoding="latin-1")
g1_dict = {k:v for (k,v) in zip(g1["CO_PAIS"],g1["CO_PAIS_ISOA3"])}

df["country_id"] = df["CO_PAIS"].map(g1_dict).str.lower()

df.head()

,Unnamed: 0,CO_ANO,CO_MES,SH4,CO_PAIS,SG_UF_MUN,CO_MUN,KG_LIQUIDO,VL_FOB,time_id,hs4_id,country_id
0,0,1997,1,8482,249,SP,3448708,210,8164,199701,37410,usa
1,1,1997,1,8432,249,RS,4302709,261644,256053,199701,37360,usa
2,2,1997,1,9403,275,RS,4314902,83240,263800,199701,12795,fra
3,3,1997,1,9021,756,SP,3450308,27,11104,199701,57949,zaf
4,4,1997,1,9403,23,SC,4215802,459073,1099830,199701,12795,deu

In [66]:
g2 = pd.read_csv("./resources/shared_countries.csv")
g2_dict = {k:v for (k,v) in zip(g2["iso3"],g2["id_num"])}

df["country_id"] = df["country_id"].map(g2_dict)

df.head()

,Unnamed: 0,CO_ANO,CO_MES,SH4,CO_PAIS,SG_UF_MUN,CO_MUN,KG_LIQUIDO,VL_FOB,time_id,hs4_id,country_id
0,0,1997,1,8482,249,SP,3448708,210,8164,199701,37410,842
1,1,1997,1,8432,249,RS,4302709,261644,256053,199701,37360,842
2,2,1997,1,9403,275,RS,4314902,83240,263800,199701,12795,1251
3,3,1997,1,9021,756,SP,3450308,27,11104,199701,57949,711
4,4,1997,1,9403,23,SC,4215802,459073,1099830,199701,12795,276

In [67]:
s = pd.read_csv("./resources/UF.csv", sep=";", encoding="latin-1")
s_dict = {k:v for (k,v) in zip(s["SG_UF"],s["CO_UF"])}

df["state_id"] = df["SG_UF_MUN"].map(s_dict)

df.head()

,Unnamed: 0,CO_ANO,CO_MES,SH4,CO_PAIS,SG_UF_MUN,CO_MUN,KG_LIQUIDO,VL_FOB,time_id,hs4_id,country_id,state_id
0,0,1997,1,8482,249,SP,3448708,210,8164,199701,37410,842,41
1,1,1997,1,8432,249,RS,4302709,261644,256053,199701,37360,842,45
2,2,1997,1,9403,275,RS,4314902,83240,263800,199701,12795,1251,45
3,3,1997,1,9021,756,SP,3450308,27,11104,199701,57949,711,41
4,4,1997,1,9403,23,SC,4215802,459073,1099830,199701,12795,276,44

In [68]:
df["municipality_id"] = df["CO_MUN"]
df["liquid_kg"] = df["KG_LIQUIDO"]
df["fob"] = df["VL_FOB"]

df.head()

,Unnamed: 0,CO_ANO,CO_MES,SH4,CO_PAIS,SG_UF_MUN,CO_MUN,KG_LIQUIDO,VL_FOB,time_id,hs4_id,country_id,state_id,municipality_id,liquid_kg,fob
0,0,1997,1,8482,249,SP,3448708,210,8164,199701,37410,842,41,3448708,210,8164
1,1,1997,1,8432,249,RS,4302709,261644,256053,199701,37360,842,45,4302709,261644,256053
2,2,1997,1,9403,275,RS,4314902,83240,263800,199701,12795,1251,45,4314902,83240,263800
3,3,1997,1,9021,756,SP,3450308,27,11104,199701,57949,711,41,3450308,27,11104
4,4,1997,1,9403,23,SC,4215802,459073,1099830,199701,12795,276,44,4215802,459073,1099830

In [69]:
f_dict = {"EXP":1,
          "IMP":2}
df["flow_id"] = f_dict[params["flow"]]

df = df[["time_id","flow_id","hs4_id","country_id","state_id","municipality_id","liquid_kg","fob"]]

df.head()

,time_id,flow_id,hs4_id,country_id,state_id,municipality_id,liquid_kg,fob
0,199701,1,37410,842,41,3448708,210,8164
1,199701,1,37360,842,45,4302709,261644,256053
2,199701,1,12795,1251,45,4314902,83240,263800
3,199701,1,57949,711,41,3450308,27,11104
4,199701,1,12795,276,44,4215802,459073,1099830